app/controllers/gifts_controller.rb

  def create
    @gift = current_user.gifts.create(params[:gift])
---
INSERT INTO "gifts" ("created_at", "gift_id", "gifter_id", "giftername", "item", "message", "name", "owner_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)